// ? ფუნქციები Javascript-ში.

// * ჯავასკრიპტში ფუნქცია შეგვიძლია წარმოვიდგინოთ როგორც ერთგვარი კონტეინერი.
// * რომელიც ინახავს კოდს. ეს კონტეინერი დახურულია მანამ სანამ მას არ გავაღებთ:
// * გაღებაში იგულისხმება ამ ფუნქციის გამოძახება. სწორედ მაშინ ამოექმედდება ფუნქციაში არსებული კოდი.


// * მაგ:


// * ფუნქციის შექმნა:
// function sayHi() {
//     alert("Hello World");
// }

// * ფუნქციის გამოძახება:
// sayHi();

// ? ფუნქციის სინტაქსი შემდეგნაირია

// * განვსაზღვროთ რომ ეს არის ფუნქცია ეს ხდება Function Prefix-ით
// * შემდგომ ფუნქციის სახელი და ფრჩხილები ()
// * შემდგომ ფუნქციის სხეულის ფრჩხილები სადაც მოხდება უშუალოდ ლოგიკის ჩაწერა { }

// function myFirstFunction(){
//     alert("My First Function");
// }

// * ფუნქციის () შიგნით შეგვიძლია გადავცეთ პარამეტრები.
// * ამ პარამეტრების გამოყენება შეგვიძლია ფუნქციის შიგნით.
// * მათზე შეგვიძლია ნებისმიერი ტიპის ზემოქმედება

// ? მაგ:


// * ამ ფუქნციაში გადავეცით 2 პარამეტრი

// ? name
// ? surname

// ! დავაკვირდეთ მათთვის მნიშვნელობა არ მიგვინიჭებია.
// ! მათთვის მნიშვნელობის მინიჭება ხდება ფუნქციის გამოძახებისას.
function sayHelloToUser(name, surname) {
    alert(`Hello ${name} ${surname}`);
}

// ? ფუნქციის გამოძახება:

// ? sayHelloToUser("Aleksandre", "Kupatadze");


// ? ამ შემთხვევაში ჩვენი ფუნქცია არაფერს გამოიტანს ის უბრალოდ შეინახავს მნიშნველობას
// ? რომელსაც მივიღებთ ფუნქციის გამოძახებისას
// function toSquare(number) {
//     return number * number;
// }

// * ჩვენ შემდგომ შეგვიძლია განვსაზღვროთ როგორ მოვიხმართ მიღებულ მნიშვნელობას
// alert(toSquare(5));

// ? საკლასო დაწერეთ ფუნქცია რომელიც მიიღებს ორ პარამეტრს
// * სიგრძეს (Length)
// * სიგანეს (Width)

// * ჩვენმა ფუნქციამ უნდა გამოთვალოს ფართობი და დაგვიბრუნოს
// * ფართობი გამოვიტანოთ ალერტით

// მივიღოთ მნიშვნელობა Input-იდან ფუნქციის მეშვეობით

function getValue(){
    let number = document.getElementById("getValueFromMe").value;

    let outPut = document.getElementById("output");
    outPut.innerHTML = number;
}



// ! მოვუსმინოთ ღილაკზე დაჭერას
// ? ამისი ორი გზა გვაქვს

// ? პირველი გზა
let button = document.getElementById("button");
button.addEventListener("click", getValue);

// ? მეორე გზა
// ? მოვუსმინოთ ღილაკზე დაჭერას პირდაპირ HTML-ში
//   <button className="button" id="button" onClick="getValue()">მნიშვნელობის აღება</button>

// Todo: საშინაო დავალება (მარტივი კალკულატორი)
// ? შექმენით 2 ინფუთი
// ? შექმენით 4 ცალი ღილაკი

// ? ღილაკების ფუნქციონალი

// ? მიმატება
// ? გამოკლება
// ? გამრავლება
// ? გაყოფა

// დაწერეთ ამ ღილაკების ფუნქციონალი და შედეგი გამოიტანეთ HTML- ში

